import { useActionState } from "react"

import { createPost } from "./action";


import {type PostState} from"./action";

import Button from "./FormStatusComponent";

// FormData
//  یه 
// API
//  داخلی 
// (built-in)
//  در مرورگرها و محیط‌های 
// web–compatible مثل 
// Node.js (از نسخه‌های جدید) 
// هست.
// بنابراین نیازی به 
// import
//  نداره — خودش به‌صورت 
// global
//  در محیط اجرا وجود داره.


//  هوک یوز اکشن استیت یکی از هوک های جدید ری اکت هست برای مدیریت بهینه فرم ها بدون رندر اضافی 
// و بدون استفاده از تعریف استیت جدا
// یک تابع رو به عنوان ورودی میگیره که اون تابع ای سینک هست و دیتا رو  از اتربیوت اکشن میگیره و میفرسته سمت سرور
// یک استیت اولیه که ما اینجا یک ابجکت رو دادیم که یک کلید ارور داره برای هندل کردن ارور و دیگری دیتا برای مقادیر دیتا
// این هوک دی استراک ارایه است که ترتیب مهمه مقدار اول میشه استیت  که میتونیم توی یوی ای نشون بدیم که اینجا ابچکت هست
// دومی فرم اکشن که ما اسمشو به این صورت نوشتیم در واقع همون تابع کریت پست هست این فرم اکشن به اتربیوت اکشن تگ فرم پاس داده میشه
//  و فرم دیتا که یک ای پی ای داخلی هست اطلاعات فرم مارو میگیره میده به تابع کری ت پست و اون میفرسته سمت سرور
//  تابع کریت پست رو میشه اینجاهم توسعه داد ولی بخاطر معماری تمیز داخل یک فایل جدا  توسعه داده شده و اینجا ایمپورت شده داخل فایل اکشن تی اس
// میتونیم ایز پندینگ رو هم ازش بعنوان مورد سوم استفاده کنیم  از این هوک که من اینجا ازش استفاده نکردم بجاش از هوک یوز استاتوس فرم داخل کامپونت باتن
// استفاده کردم و اون رو اینجا ایمپورت کردم که داخل اون هوک ایز پندینگ رو داره

// کاربردش چیه
// خودش فرم رو  ریست میکنه
// ری رندر اضافی نداره مثل وقتی که از روش های قدیم از چند استیت استفاده میکردیم
// ایز پندینگ رو داره خودش که اینجا من تو دی استراک نیاوردم از یک هوک دیگه استفده کردم
// نیاز نیست برای ارورها استیت تعریف کنیم  داخل تابع کریت پست وقتی نتیجه ری ترن میشه یک ابجکت یک کلید ارور گذاشتیم و توی کچ ارور بهش مقدار دادیم
// تابع ارسال دیتا داره که میاد از وب ای پی ای فرم دیتا استفاده میکنه با اتربیوت اکشن ودیتارو میده به سرور

const ActionStateComponent = () => {
 const[state,formAction]=useActionState<PostState, FormData>(createPost,{ data: undefined, error: null });
  return (
    <div>
      <h1>useActionState-react19</h1>

      <form action={formAction}>
        <label htmlFor="title">title</label>
        <input type="text" name="title"  placeholder="title" /><br />
        <label htmlFor="body">body</label>
        <input type="text" name="body"  placeholder="body" />
        <Button/>
        {!!state?.error&& <p>{JSON.stringify(state.error)}</p>}
        {!!state?.data&& <p>{JSON.stringify(state.data)}</p>}
        </form>

    </div>
  )
}

export default ActionStateComponent